<template lang="pug">
    dl.list.list--life-events
        .list__item(
            v-for="({ year, description }, index)\
                in lifeEvents\
            "
        )
            dt.list__year {{year}}
            dd.p {{description}}
</template>

<script>
export default {
    data() {
        return {
            lifeEvents: [
                {
                    year: '',
                    description: `Борис Кустодиев родился 7 марта 1878 года в Астрахани. Отца,
                        преподавателя духовной семинарии, не стало, когда мальчику
                        было чуть больше года. Мать осталась вдовой в 25 лет
                        и содержала четверых детей.`,
                },
                {
                    year: 1887,
                    description: `Борис сначала учился в церковно-приходской школе, потом
                        в гимназии. Когда ему было девять лет, в город привезли выставку
                        художников-передвижников. Мальчика настолько впечатлила
                        живопись, что он твердо решил научиться рисовать так же
                        искусно. Мать нашла деньги, чтобы Борис смог брать уроки у
                        известного в Астрахани художника Павла Власова.`,
                },
                {
                    year: 1896,
                    description: `Окончив семинарию, в 1896 году Кустодиев отправился учиться
                        в Москву, но в художественную школу его не приняли: Борису уже
                        исполнилось 18 и он был слишком взрослым. Тогда Кустодиев
                        поехал в Петербург, где подал документы
                        в Высшее художественное училище при Академии художеств.`,
                },
            ],
        };
    },
};
</script>

<style lang="scss" scoped>
@import 'list.scss';
</style>
